import { Block, Text, View } from '@tarojs/components'
import { memo } from 'react'

const Index = memo(() => {
  return (
    <View style={{ padding: '20rpx', lineHeight: '60rpx' }}>
      <View>
        <View className='a_title'>免责声明</View>
        <View className='a_content'>
          本小程序(以下称作本小程序)作为线上交流平台，不具备充分的监控能力以审查素材是否存在侵权等情况。对于上传至本小程序的任何作品，请勿用于任何商业用途的范围。用户应自觉遵守著作权法及其他相关法律的规定，不得侵犯作品权利人的合法权利。用户在本发表的内容(包含但不限于本现有各产品、功能里的内容)，仅表明其个人的立场和观点，并不代表本的立场和观点。作为内容的发表者，需自行对所发表的内容负责，因所发表的内容引发的一切纠纷、损失，由该内容的发表者承担全部直接或间接(连带)法律责任，本不承担任何法律责任。
          <View></View>
          用户在本发表的内容(包含但不限于现有功能中的内容)，均系用户个人行为产生，任何个人、公司或其他主体使用上述内容从事盈利性或非盈利性行为导致的侵犯他人知识产权或其他合法权益而产生的一切纠纷、损失均由该个人、公司或其他主体承担全部直接或间接(连带)法律责任，本不承担任何法律责任。
          用户在本程序发布或侵犯他人知识产权或其他合法权益的内容时或者接到相关权利人投诉、举报时，本有权对侵权内容予以删除或进行其他限制措施，并保留移交相关行政机关处理的权利，本程序不承担因此产生的一切损失或其他法律责任。
          个人用户在申请注册用户时，不得使用已在工商局注册的企业或品牌名称作为用户名，经查实无法提供相关证明的，本有权收回帐号。本的删除或其他限制措施行为系履行网络服务提供者的审查、监管义务行为，不承担相关赔偿责任。本程序作为网络服务提供者与用户及相关权利人之间的纠纷无关。
          <View></View>
          上传内容分类说明：
          <View></View>
          1、无版权资源：未申请版权的资源内容
          <View></View>
          2、转载资源：不确定是否有版权，从其他网站或平台下载的内容
          <View></View>
          3、原创作品：个人或团队独立完成的创作。与他人无关。
          <View></View>
          我们鼓励用户对网站上的作品进行全面监督，当版权拥有者提出侵权指控并出示充分的版权证明材料时，我们会在第一时间对投诉举报进行核实，并及时清理侵权作品。对于用户上传的作品，我们在有理由确信该作品存在明显侵权、违法、违反公共利益等情形的作品时，我们针对该作品采取移除等相应措施后不为此向原发布人承担违约责任或其他法律责任，包括不承担因侵权指控不成立而给原发布人带来损害的赔偿责任。
          <View></View>
          举报请联系QQ:2214380963
        </View>
        <View className='a_title'>维权须知</View>
        <View className='a_content'>
          任何个人、公司或其他主体如认为本程序上存在侵犯其自身合法权益的内容，应及时与本程序取得联系同时向本程序提交相关书面通知书，以便本程序迅速做出处理。通知书应当包含下列内容：
          <View></View>
          权利人的姓名(名称)、联系方式和地址；
          <View></View>
          要求删除或者断开链接的具体侵权内容的截图及名称
          <View></View>
          构成侵权的初步证明材料。
          <View></View>
          权利人应当对通知书的真实性负责。权利人未提交通知书的本程序有权在核实情况后再行处理，因此产生的一切损失由权利人承担。
          <View></View>
          用户认为其在本程序发布的图片、头像、文字内容未侵犯他人权利的在接到本程序侵权处理通知时可以向本程序提交书面说明要求解除相关限制措施(不包
          括不可恢复性措施)。书面说明应当包含下列内容：
          <View></View>
          用户的姓名(名称)、联系方式和地址；要求恢复的内容名称和不构成侵权的初步证明材料。用户应当对书面说明的真实性负责。用户不提交书面说明的，本程序不自动恢复相关措施。
        </View>
      </View>
    </View>
  )
})

export default Index
